<template>
  <div>
    <ul class="menu">
      <li :class="this.listItemBackgroundGenerator('/edit-profile')">
        <NuxtLink  to="/edit-profile">
          <svg class="h-6 me-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M272 304H176C78.797 304 0 382.797 0 480C0 497.672 14.326 512 32 512H416C433.674 512 448 497.672 448 480C448 382.797 369.203 304 272 304ZM48.994 464C56.895 400.945 110.84 352 176 352H272C337.16 352 391.105 400.945 399.006 464H48.994ZM224 256C294.693 256 352 198.691 352 128C352 57.307 294.693 0 224 0S96 57.307 96 128C96 198.691 153.307 256 224 256ZM224 48C268.111 48 304 83.887 304 128C304 172.111 268.111 208 224 208S144 172.111 144 128C144 83.887 179.889 48 224 48Z"/>
          </svg>
          ویرایش پروفایل
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li :class="this.listItemBackgroundGenerator('/orders')">
        <NuxtLink to="/orders">
          <svg xmlns="http://www.w3.org/2000/svg" class="me-4 w-6" viewBox="0 0 640 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M616 399.997H144V64C144 28.8 115.2 0 80 0H24C10.801 0 0 10.801 0 24C0 37.201 10.801 48 24 48H72C85.255 48 96 58.745 96 72V415.997C96 433.597 110.4 447.997 128 447.997H162.939C161.15 453.026 160 458.358 160 464C160 490.51 181.49 512 208 512S256 490.51 256 464C256 458.358 254.85 453.026 253.061 447.997H450.939C449.15 453.026 448 458.358 448 464C448 490.51 469.49 512 496 512S544 490.51 544 464C544 458.358 542.85 453.026 541.061 447.997H616C629.199 447.997 640 437.198 640 423.997C640 410.798 629.199 399.997 616 399.997ZM256 352.001H544C579.346 352.001 608 323.347 608 288.002V96.003C608 60.656 579.346 32.004 544 32.004H256C220.654 32.004 192 60.656 192 96.003V288.002C192 323.347 220.654 352.001 256 352.001ZM240 96.003C240 87.181 247.178 80.003 256 80.003H336V192.002L400 160.003L464 192.002V80.003H544C552.822 80.003 560 87.181 560 96.003V288.002C560 296.824 552.822 304.002 544 304.002H256C247.178 304.002 240 296.824 240 288.002V96.003Z"/>
          </svg>
          سفارشات من
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li :class="this.listItemBackgroundGenerator('/favorites')">
        <NuxtLink to="/favorites">
          <svg class="w-6 me-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M462.969 62.859C438.777 41.92 408.871 31.998 378.724 32C341.236 32 303.379 47.344 275.693 75.924L256.008 96.248L236.32 75.924C208.633 47.34 170.783 32 133.291 32C103.148 32 73.23 41.926 49.041 62.861C-13.104 116.652 -16.197 212.516 39.824 270.484L232.974 470.195C239.295 476.732 247.627 480 255.961 480C264.293 480 272.625 476.732 278.947 470.195L472.096 270.484C528.211 212.516 525.117 116.648 462.969 62.859ZM437.594 237.115L255.961 424.918L74.34 237.129C42.098 203.765 34.459 138.971 80.455 99.154C120.359 64.615 175.047 81.659 201.842 109.32C231.279 139.709 210.354 118.108 256.008 165.238C293.767 126.256 282.996 137.375 310.172 109.32C336.59 82.047 391.433 64.427 431.557 99.152C477.123 138.59 470.518 203.101 437.594 237.115Z"/>
          </svg>
          لیست علاقه‌مندی‌های من
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li :class="this.listItemBackgroundGenerator('/addresses')">
        <NuxtLink to="/addresses">
          <svg class="h-6 w-6 me-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M192 0C85.969 0 0 85.969 0 192C0 269.41 26.969 291.035 172.281 501.676C177.047 508.559 184.523 512 192 512S206.953 508.559 211.719 501.676C357.031 291.035 384 269.41 384 192C384 85.969 298.031 0 192 0ZM192 445.836C174.307 420.371 158.582 397.969 144.623 378.086C57.562 254.066 48 238.875 48 192C48 112.598 112.598 48 192 48S336 112.598 336 192C336 238.875 326.438 254.066 239.377 378.086C225.412 397.98 209.684 420.383 192 445.836ZM192 112C147.818 112 112 147.816 112 192S147.818 272 192 272C236.184 272 272 236.184 272 192S236.184 112 192 112ZM192 224C174.355 224 160 209.645 160 192S174.355 160 192 160S224 174.355 224 192S209.645 224 192 224Z"/>
          </svg>
          آدرس‌های من
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li :class="this.listItemBackgroundGenerator('/product-view-histories')">
        <NuxtLink to="/product-view-histories">
          <svg class="h-6 w-6 me-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 576 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M572.531 238.973C518.281 115.525 410.938 32 288 32S57.688 115.58 3.469 238.973C1.562 243.402 0 251.041 0 256C0 260.977 1.562 268.596 3.469 273.025C57.719 396.473 165.062 480 288 480S518.312 396.418 572.531 273.025C574.438 268.596 576 260.957 576 256C576 251.023 574.438 243.402 572.531 238.973ZM288 432C188.521 432 96.836 364.502 48.424 256.004C97.01 147.365 188.611 80 288 80C387.48 80 479.164 147.498 527.576 255.994C478.99 364.635 387.389 432 288 432ZM288 128C217.334 128 160 185.348 160 256S217.334 384 288 384H288.057C358.695 384 416 326.68 416 256.055V256C416 185.348 358.668 128 288 128ZM288 336C243.889 336 208 300.111 208 256C208 255.252 208.199 254.559 208.221 253.816C213.277 255.125 218.52 256 224 256C259.346 256 288 227.346 288 192C288 186.52 287.125 181.277 285.816 176.221C286.559 176.199 287.252 176 288 176C332.111 176 368 211.889 368 256.055C368 300.137 332.137 336 288 336Z"/>
          </svg>
          آخرین محصولات بازدید شده
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li :class="this.listItemBackgroundGenerator('')">
        <NuxtLink to="">
          <svg class="h-6 w-6 me-4" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M416 192H384V128C384 57.422 326.578 0 256 0S128 57.422 128 128V192H96C60.654 192 32 220.654 32 256V448C32 483.346 60.654 512 96 512H416C451.346 512 480 483.346 480 448V256C480 220.654 451.346 192 416 192ZM176 128C176 83.891 211.891 48 256 48S336 83.891 336 128V192H176V128ZM432 448C432 456.822 424.822 464 416 464H96C87.178 464 80 456.822 80 448V256C80 247.178 87.178 240 96 240H416C424.822 240 432 247.178 432 256V448ZM256 304C242.75 304 232 314.75 232 328V376C232 389.25 242.75 400 256 400S280 389.25 280 376V328C280 314.75 269.25 304 256 304Z"/>
          </svg>
          تغییر یا ایجاد رمز عبور
        </NuxtLink>
        <div class="divider-h ms-16"></div>
      </li>
      <li @click="logout">
        <a>
          <svg class="h-6 w-6 me-4"  xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
            <!-- Font Awesome Pro 6.0.0-alpha2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license (Commercial License) -->
            <path
              d="M192 456C192 469.254 181.254 480 168 480H96C42.98 480 0 437.02 0 384V128C0 74.98 42.98 32 96 32H168C181.254 32 192 42.742 192 56C192 69.254 181.254 80 168 80H96C69.6 80 48 101.602 48 128V384C48 410.398 69.6 432 96 432H168C181.254 432 192 442.742 192 456ZM505.461 239.562L377.464 103.562C368.37 93.875 353.183 93.438 343.558 102.531C333.902 111.594 333.434 126.781 342.527 136.437L432.443 232H183.999C170.75 232 160 242.75 160 256S170.75 280 183.999 280H432.443L342.527 375.562C333.434 385.219 333.902 400.406 343.558 409.469C348.183 413.844 354.089 416 359.996 416C366.37 416 372.745 413.469 377.464 408.438L505.461 272.438C514.18 263.219 514.18 248.781 505.461 239.562Z"/>
          </svg>
          خروج از حساب کاربری
        </a>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: "ProfileMenu",
  methods: {
    logout() {
      this.$auth.logout()
    },
    listItemBackgroundGenerator(route) {
      return this.$route.path === route ? 'bg-primary text-white' : 'bg-white'
    }
  },
}
</script>

<style scoped lang="scss">
.menu li>a, .menu li>span {
  padding: 1rem 1.5rem;
}
</style>
